name: "ensemble_sample"
platform: "ensemble"
max_batch_size: 0
input [
  {
    name: "input__0"
    data_type: TYPE_FP32
    dims: [-1]
  }
]

output [
  {
    name: "output__0"
    data_type: TYPE_FP32
    dims: [-1]
  }
]

ensemble_scheduling {
    step [
        {
            model_name: "one_model"
            model_version: -1
            input_map {
                key: "one_input"
                value: "input__0"
            }
            output_map {
                key: "one_output"
                value: "one_result"
            }
        },
        {
            model_name: "two_model"
            model_version: -1
            input_map {
                key: "two_input"
                value: "one_result"
            }
            output_map {
                key: "two_output"
                value: "output__0"
            }
        }
    ]
}
