name: "add_net"
backend: "python"
max_batch_size: 0

input [
    {
        name: "INPUT__0"
        data_type: TYPE_FP32
        dims: [-1]
    },
    {
        name: "INPUT__1"
        data_type: TYPE_FP32
        dims: [-1]
    }
]
output [
    {
        name: "OUTPUT__0"
        data_type: TYPE_FP32
        dims: [-1]
    }
]

instance_group [
    {
        count: 1
        kind: KIND_CPU

        # kind: KIND_GPU
        # gpus: [0]
    }
]